/**
 * 用于提供正则验证 比如验证 邮箱，地址
 */

export default {
		// 验证手机号码的
		CHECK_PHONE: /^1((3[\d])|(4[5,6,9])|(5[0-3,5-9])|(6[5-7])|(7[0-8])|(8[1-3,5-8])|(9[1,8,9]))\d{8}$/,
		// 验证座机号码的
		CHECK_NUMBER: /\d{3}-\d{8}|\d{4}-\d{7}/,
		// 由26个英文字母组成的字符串
		CHECK_STRING: /^[A-Za-z]+$/,
		// 验证地址的 规则：只能输入中文、 英文、 数字 但不能是纯数字的正则表达式
		CHECK_ADDRESS: /([\u4e00-\u9fa5a-zA-Z]+[0-9]*)/,
		// 由26个英文字母的大写组成的字符串
		CHECK_UPPER_STRING: /^[A-Za-z]+$/,
		// 由26个英文字母的小写组成的字符串
		CHECK_LOWER_STRING: /^[A-Za-z0-9]+$/,
		// 验证邮箱的地址
		CHECK_EMAIL: /^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$/,
		// 匹配首尾空格的正则
		CHECK_SPACE: /(^s*)|(s*$)/,
		// 用户名正则，4到16位（字母，数字，下划线，减号）
		CHECK_USERNAME: /^[a-zA-Z0-9_-]{4,16}$/,
		// 身份证号（18位）正则
		CHECK_ID_CARD: /^[1-9]\d{5}(18|19|([23]\d))\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$/,
		// 密码强度正则，最少6位，包括至少1个大写字母，1个小写字母，1个数字，1个特殊字符
		CHECK_PASSWORD: /^.*(?=.{6,})(?=.*\d)(?=.*[A-Z])(?=.*[a-z])(?=.*[!@#$%^&*? ]).*$/,
		// 输入名称正则 只能输入 中文 数字 字母 下划线
		CHECK_NAME: /^[\u4E00-\u9FA5A-Za-z0-9_]+$/
}

